AlphaStudioDE/SnapHeater-U1/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_LWIP_MAX_SOCKETS=16

# Development defaults. Change with: idf.py menuconfig
CONFIG_SHU1_WIFI_SSID="YOUR_WIFI"
CONFIG_SHU1_WIFI_PASSWORD="YOUR_PASSWORD"
CONFIG_SHU1_MOONRAKER_HOST="192.168.1.100"
CONFIG_SHU1_MOONRAKER_PORT=7125

# DragonBreath-validated Panda Breath V1.0/V1.0.1 hardware map. Outputs remain
# build-disabled below and runtime-disarmed after every boot.
CONFIG_SHU1_HEATER_GPIO=18
CONFIG_SHU1_FAN_GPIO=3
CONFIG_SHU1_ZERO_CROSS_GPIO=7
CONFIG_SHU1_RREF_STRAP_GPIO=19
CONFIG_SHU1_BUTTON_GPIO=-1
CONFIG_SHU1_STATUS_LED_GPIO=-1
CONFIG_SHU1_CHAMBER_ADC_CH=0
CONFIG_SHU1_PTC_ADC_CH=1
CONFIG_SHU1_HEATER_ACTIVE_HIGH=y
CONFIG_SHU1_FAN_ACTIVE_HIGH=y
CONFIG_SHU1_ENABLE_FAN_TRIAC_CONTROL=n
CONFIG_SHU1_ENABLE_PHYSICAL_CONTROLS=n
CONFIG_SHU1_BUTTON_POWER_GPIO=9
CONFIG_SHU1_BUTTON_AUTO_GPIO=8
CONFIG_SHU1_BUTTON_ON_GPIO=10
CONFIG_SHU1_BUTTON_DRY_GPIO=2
CONFIG_SHU1_LED_AUTO_GPIO=6
CONFIG_SHU1_LED_ON_GPIO=5
CONFIG_SHU1_LED_DRY_GPIO=4
CONFIG_SHU1_ENABLE_POWER_LED=n
CONFIG_SHU1_LED_POWER_GPIO=21

# Hard safety defaults: physical outputs and diagnostic probe API are disabled.
CONFIG_SHU1_ENABLE_HEATER_OUTPUT=n
CONFIG_SHU1_ENABLE_GPIO_PROBE=n
CONFIG_SHU1_MAX_FAN_PROBE_MS=3000

# NTC conversion uses DragonBreath's fixed 3.3 V divider model, GPIO19-selected
# 33/82 kOhm Rref, raw fault thresholds and 114-entry stock R/T table.

# Policy based on multi-version functional extraction.
CONFIG_SHU1_TARGET_TEMP_C=50
CONFIG_SHU1_MAX_TARGET_TEMP_C=70
CONFIG_SHU1_PTC_CUTOFF_C=0
CONFIG_SHU1_FILTER_TRIGGER_BED_C=30
CONFIG_SHU1_HEATER_TRIGGER_BED_C=80

# BLE / Android local control. Uses ESP-IDF NimBLE host.
CONFIG_SHU1_ENABLE_BLE=y
CONFIG_SHU1_BLE_DEVICE_NAME="SnapHeater U1"
CONFIG_SHU1_BLE_REQUIRE_PIN_FOR_CONTROL=y
CONFIG_SHU1_BLE_CONTROL_PIN="123456"
CONFIG_SHU1_BLE_NOTIFY_PERIOD_MS=2000
CONFIG_SHU1_BLE_MAX_WRITE_BYTES=1024
CONFIG_SHU1_BLE_MAX_READ_BYTES=4096

# ESP-IDF Bluetooth / NimBLE defaults for ESP32-C3.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256

# v0.7 smart heating policy defaults.
CONFIG_SHU1_DEFAULT_FAN_POSTRUN_MIN=1
CONFIG_SHU1_DEFAULT_TEMPERING_ENABLED=y
CONFIG_SHU1_DEFAULT_TEMPERING_END_TEMP_C=35
CONFIG_SHU1_DEFAULT_TEMPERING_DURATION_MIN=30
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
